
export interface Recipes {
  id: number;
  name: string;
  calories: number;
  image: string;
  directions: string;
  link: "/product-detail/";
  
}

export const RECIPES : Recipes[] = [
    {
      id: 1,
      name: "삼치튀김, 타르타르소스",
      directions: "1. 삼치의 살과 가시를 분리한다.<br>2. 키친타올로 삼치살의 핏기와 물기를 제거한 뒤 후추와 레몬즙을 뿌려 비린내를 제거한다.<br>3. 볼에 튀김가루, 계란, 물, 식용유를 섞어 튀김옷을 만든다.<br>4. 삼치에 튀김옷을 입힌 뒤 170℃ 기름에서 두 번 튀긴다.<br>5. 삶은 계란, 홍고추, 청양고추, 양파를 다져 볼에 섞은 뒤 마요네즈와 레몬즙을 섞어 소스를 만든다.<br>6. 삼치 튀김에 타르타르소스를 곁들여 담는다.<br>",
      calories: 139.65,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408111442_1554689682742.jpg",
      link: "/product-detail/",
      
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    {
      id: 2,
      name: '두부해물완자',
      directions: "1. 두부를 으깨고 오징어와 새우는 잘게 다진다.<br>2. 볼에 1의 재료와 감자전분을 넣고 섞어 완자모양으로 만든다.<br>3. 감자전분과 부침가루를 섞어 완자에 묻힌다.<br>4. 가루를 묻힌 완자에 계란물을 입혀 기름 두른 팬에 굴려가며 익힌다.<br>5. 마늘과 파를 다진 뒤 새우가루, 꿀, 저염간장을 섞어 소스를 만든다.<br>6. 양파를 채 썰어 냄비에 소스와 함께 끓인 뒤 전분물을 넣어 농도를 맞추고 완자를 넣는다.<br>",
      calories: 68,
      image: "http://www.foodsafetykorea.go.kr/uploadimg/20190408/20190408112127_1554690087850.jpg",
      link: "/product-detail/",
    },
    
  ];

  